import numpy as np
import matplotlib.pyplot as plt
from collections import Counter
import pylab

text = "Веснянії пісні,є\
        Веснянії сни,\
        Чом так безутішні,\
        Безвідрадні ви?\
        Чи для вас немає\
        Зелені в лісах,\
        Чи для вас не сяє\
        Сонце в небесах?\
        Чи для вас весела\
        Квітка не цвіте,\
        Що лиш вбогі села,\
        Людський біль здрите?\
        Ох, живі діброви,\
        Ясний сонця світ,\
        Лиш життя, любови\
        В людських душах ніт!\
        Втішно птиця лине,\
        Гамір, співи, крик…\
        Тільки бідний гине\
        З голоду мужик.\
        Цвіти серед поля\
        Долом і горов –\
        Тільки тьма й неволя\
        П’є народну кров.\
        Краще б то для моди\
        Заспівати, бач,\
        Про красу природи,\
        Ніж про людський плач.\
        Але не для моди\
        Се співаю я,\
        То й сумна виходить\
        Пісенька моя."   

def lettersBar():
    alphabet = ['а', 'б', 'в', 'г', 'ґ', 'д',\
                'е', 'є', 'ж', 'з', 'и', 'і',\
                'ї', 'й', 'к', 'л', 'м', 'н',\
                'о', 'п', 'р', 'с', 'т', 'у',\
                'ф', 'х', 'ц', 'ч', 'ш', 'щ',\
                'ь', 'ю', 'я']
                
    for i in range(0, len(alphabet)):
        print(alphabet[i], text.count(alphabet[i]))

        xdata = [alphabet[i]]
        ydata = [text.count(alphabet[i])]
        pylab.bar(xdata, ydata)

    pylab.show()

lettersBar()